FROM node:24.10.0

# Рабочая директория внутри контейнера, где будут лежать файлы приложения.
WORKDIR /app

# Сначала копируем файлы зависимостей, чтобы Docker мог кешировать слой установки.
COPY package.json package-lock.json ./

# Устанавливаем зависимости backend-приложения.
RUN npm install

# После установки зависимостей копируем остальной код проекта.
COPY . .

# Документируем порт, который использует приложение внутри контейнера.
EXPOSE 3000

# Генерируем Prisma Client во время сборки образа.
RUN npx prisma generate

# При старте контейнера применяем миграции и затем запускаем сервер.
CMD ["sh", "-c", "npm run db:migrate-prod && npm run start"]
